test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:typ="http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/types/">
<soapenv:Header/>
<soapenv:Body>
   <typ:submitESSJobRequest>
      <typ:jobPackageName>/oracle/apps/ess/financials/receivables/transactions/autoInvoices/</typ:jobPackageName>
      <typ:jobDefinitionName>AutoInvoiceMasterEss</typ:jobDefinitionName>
      <!--Zero or more repetitions:-->
          <typ:paramList>1</typ:paramList>
         <typ:paramList>300001096431127</typ:paramList>
         <typ:paramList>300000311435966</typ:paramList>
         <typ:paramList>12/11/19</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>null</typ:paramList>
         <typ:paramList>Y</typ:paramList>
         <typ:paramList>null</typ:paramList>
   </typ:submitESSJobRequest>
</soapenv:Body>
</soapenv:Envelope>